###################################################################

# Created by write_sdc on Thu Nov 21 11:11:52 2013

###################################################################
set sdc_version 1.7

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 5 [get_ports {outA[15]}]
set_load -pin_load 5 [get_ports {outA[14]}]
set_load -pin_load 5 [get_ports {outA[13]}]
set_load -pin_load 5 [get_ports {outA[12]}]
set_load -pin_load 5 [get_ports {outA[11]}]
set_load -pin_load 5 [get_ports {outA[10]}]
set_load -pin_load 5 [get_ports {outA[9]}]
set_load -pin_load 5 [get_ports {outA[8]}]
set_load -pin_load 5 [get_ports {outA[7]}]
set_load -pin_load 5 [get_ports {outA[6]}]
set_load -pin_load 5 [get_ports {outA[5]}]
set_load -pin_load 5 [get_ports {outA[4]}]
set_load -pin_load 5 [get_ports {outA[3]}]
set_load -pin_load 5 [get_ports {outA[2]}]
set_load -pin_load 5 [get_ports {outA[1]}]
set_load -pin_load 5 [get_ports {outA[0]}]
set_load -pin_load 5 [get_ports {outB[15]}]
set_load -pin_load 5 [get_ports {outB[14]}]
set_load -pin_load 5 [get_ports {outB[13]}]
set_load -pin_load 5 [get_ports {outB[12]}]
set_load -pin_load 5 [get_ports {outB[11]}]
set_load -pin_load 5 [get_ports {outB[10]}]
set_load -pin_load 5 [get_ports {outB[9]}]
set_load -pin_load 5 [get_ports {outB[8]}]
set_load -pin_load 5 [get_ports {outB[7]}]
set_load -pin_load 5 [get_ports {outB[6]}]
set_load -pin_load 5 [get_ports {outB[5]}]
set_load -pin_load 5 [get_ports {outB[4]}]
set_load -pin_load 5 [get_ports {outB[3]}]
set_load -pin_load 5 [get_ports {outB[2]}]
set_load -pin_load 5 [get_ports {outB[1]}]
set_load -pin_load 5 [get_ports {outB[0]}]
create_clock [get_ports clk]  -name CLK  -period 3.5  -waveform {0 1.75}
set_input_delay -clock CLK  -max 0.8  [get_ports clk]
set_input_delay -clock CLK  -max 0.8  [get_ports {addressA[4]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {addressA[3]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {addressA[2]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {addressA[1]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {addressA[0]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {addressB[4]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {addressB[3]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {addressB[2]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {addressB[1]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {addressB[0]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {dataIn[15]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {dataIn[14]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {dataIn[13]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {dataIn[12]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {dataIn[11]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {dataIn[10]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {dataIn[9]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {dataIn[8]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {dataIn[7]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {dataIn[6]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {dataIn[5]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {dataIn[4]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {dataIn[3]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {dataIn[2]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {dataIn[1]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {dataIn[0]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {addressIn[4]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {addressIn[3]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {addressIn[2]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {addressIn[1]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {addressIn[0]}]
set_input_delay -clock CLK  -max 0.8  [get_ports reset]
set_input_delay -clock CLK  -max 0.8  [get_ports write]
set_output_delay -clock CLK  -max 0.8  [get_ports {outA[15]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outA[14]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outA[13]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outA[12]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outA[11]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outA[10]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outA[9]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outA[8]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outA[7]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outA[6]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outA[5]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outA[4]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outA[3]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outA[2]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outA[1]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outA[0]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outB[15]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outB[14]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outB[13]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outB[12]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outB[11]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outB[10]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outB[9]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outB[8]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outB[7]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outB[6]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outB[5]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outB[4]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outB[3]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outB[2]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outB[1]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {outB[0]}]
set_input_transition -max 1  [get_ports {addressA[4]}]
set_input_transition -max 1  [get_ports {addressA[3]}]
set_input_transition -max 1  [get_ports {addressA[2]}]
set_input_transition -max 1  [get_ports {addressA[1]}]
set_input_transition -max 1  [get_ports {addressA[0]}]
set_input_transition -max 1  [get_ports {addressB[4]}]
set_input_transition -max 1  [get_ports {addressB[3]}]
set_input_transition -max 1  [get_ports {addressB[2]}]
set_input_transition -max 1  [get_ports {addressB[1]}]
set_input_transition -max 1  [get_ports {addressB[0]}]
set_input_transition -max 1  [get_ports {dataIn[15]}]
set_input_transition -max 1  [get_ports {dataIn[14]}]
set_input_transition -max 1  [get_ports {dataIn[13]}]
set_input_transition -max 1  [get_ports {dataIn[12]}]
set_input_transition -max 1  [get_ports {dataIn[11]}]
set_input_transition -max 1  [get_ports {dataIn[10]}]
set_input_transition -max 1  [get_ports {dataIn[9]}]
set_input_transition -max 1  [get_ports {dataIn[8]}]
set_input_transition -max 1  [get_ports {dataIn[7]}]
set_input_transition -max 1  [get_ports {dataIn[6]}]
set_input_transition -max 1  [get_ports {dataIn[5]}]
set_input_transition -max 1  [get_ports {dataIn[4]}]
set_input_transition -max 1  [get_ports {dataIn[3]}]
set_input_transition -max 1  [get_ports {dataIn[2]}]
set_input_transition -max 1  [get_ports {dataIn[1]}]
set_input_transition -max 1  [get_ports {dataIn[0]}]
set_input_transition -max 1  [get_ports {addressIn[4]}]
set_input_transition -max 1  [get_ports {addressIn[3]}]
set_input_transition -max 1  [get_ports {addressIn[2]}]
set_input_transition -max 1  [get_ports {addressIn[1]}]
set_input_transition -max 1  [get_ports {addressIn[0]}]
set_input_transition -max 1  [get_ports clk]
set_input_transition -max 1  [get_ports reset]
set_input_transition -max 1  [get_ports write]
